#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//十进制转二进制   /2取余
//int main()
//{
//	int x = 0;
//	int y = 0;
//	scanf("%d %d", &x, &y);
//	int count = 0;
//	int i = 0;
//	for (i = 0;i < 32;i++)
//	{
//		if ((x % 2) != (y % 2))
//		{
//			count++;
//		}
//		x /= 2;
//		y /= 2;
//	}
//	printf("%d\n", count);
//}

/*
思路：
1. 先将m和n进行按位异或，此时m和n相同的二进制比特位清零，不同的二进制比特位为1
2. 统计异或完成后结果的二进制比特位中有多少个1即可(用于与运算)
*/
/*给出一个二进制的值1000110101011与这个值减1的值1000110101010，他们做与运算，
结果为：1000110101010。可以看到，最右侧的1变成了0.
现在我们再对1000110101010与它减1的值做与运算：*/
/*   1000110101010 & 1000110101001 = 1000110101000     */
int main()
{
	int x = 0;
	int y = 0;
	scanf("%d %d", &x, &y);

	int c = x ^ y;
	int count = 0;
	while (c)
	{
		c = c & (c - 1);
		count++;
	}
	printf("%d\n", count);
	return 0;
}
